Tekla Open API Reference for Tekla Structures 2025
AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType Class
 The AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType class defines a placing type that places the object using the along line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line and rotated to be at the same angle as the connected part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
	Inherits PreferredPlacingTypeBase
The AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType type exposes the following members.
Constructors
Name | Description
AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
 Creates a new along line or with leader line and parent object along part placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace